Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: There is an example of an on-screen display at the bottom of the Gui object page.
ja: Guiオブジェクト・ページの一番下にオンスクリーン表示の例がある。

source: There is less ambiguity without functions (like Hotkey) accepting a label or a function, where both can exist with the same name at once.
ja: （Hotkeyのように）ラベルや機能を受け入れる機能がなく、同じ名前で両方が同時に存在できるため、あいまいさが少なくなります。

source: There is no UseErrorLevel mode, no global menu names, and no explicitly deleting the menu itself (that happens when all references are released; the Delete method is equivalent to v1 DeleteAll).
ja: UseErrorLevelモード、グローバルメニュー名、メニュー自体の明示的な削除はありません（すべての参照が解放されたときに起こります；Deleteメソッドはv1 DeleteAllと同等です）。

source: There is no comma between the function name and parameters, so MouseGetPos(, y) = MouseGetPos , y (x is omitted).
ja: 関数名とパラメータの間にカンマはないので、MouseGetPos(, y)=MouseGetPos , y（xは省略）となります。

source: There is no comma between the function name and parameters, so WinMove(, y) = WinMove , y (x is omitted).
ja: 関数とパラメータの間にコンマがあってはいけません。ただし、xを省略したときはWinMove(, y) = WinMove , yのようになります。

source: There is no limit to how many variables a script may create.
ja: スクリプトが作成できる変数の数に制限はない。

source: There is no percent-space prefix to force an expression.
ja: 式を強制するためのパーセント－スペース接頭辞はありません。

source: There is no restriction on the size of the input string or its fields.
ja: 入力文字列やそのフィールドのサイズに制限はありません。

source: There is no single solution to make AutoHotkey work in all programs.
ja: AutoHotkeyをすべてのプログラムで使えるようにする唯一の解決策はありません。

source: There is no standard way to detect when the connection is no longer required, so the script must disconnect manually by calling ComObjConnect.
ja: 接続が不要になったことを検出する標準的な方法はないため、スクリプトはComObjConnectを呼び出して手動で接続を切断する必要があります。

source: There is now a distinction between properties accessed with . and data (items, array or map elements) accessed with [].
ja: .でアクセスするプロパティと、[]でアクセスするデータ（アイテム、配列、マップ要素）は区別されるようになりました。

source: There is one exception:
ja: ただし、1つだけ例外があります。

source: There is typically no need to turn this setting back off because it does not affect other threads.
ja: 他のスレッドに影響を与えないため、通常、この設定をオフに戻す必要はありません。

source: There may also be a symbolic link named "v2" pointing to the subdirectory of the last installed version.
ja: また、最後にインストールされたバージョンのサブディレクトリを指す「v2」というシンボリックリンクがあるかもしれません。

source: There may be other circumstances that produce this effect.
ja: この効果を生み出す他の状況もあるかもしれません。

source: There may be times when a hotkey should wait for its own modifier keys to be released before continuing.
ja: ホットキーは、それ自身の修飾キーが解除されるまで待ってから続行する必要がある場合があります。

source: There must be no space between the function name or expression and the open parenthesis which begins the parameter list.
ja: 関数名または式と、パラメータ・リストを始める開括弧の間にはスペースを入れてはならない。

source: There must not be any non-whitespace characters between the asterisk (*) and the symbol which ends the parameter list.
ja: アスタリスク（*）とパラメータリストを終了する記号の間には、空白文字以外の文字を含んではならない。

source: There must only be whitespace or comments between the hotkey and the function name.
ja: ホットキーと機能名の間には、空白またはコメントのみでなければなりません。

source: There must only be whitespace or comments between the hotstring and the function name.
ja: ホットストリングと関数名の間には、空白またはコメントのみでなければなりません。

source: There was a problem carring out the function's purpose, such as retrieving a setting or applying a change.
ja: 設定値の取得や変更の適用など、機能の目的を遂行する上で問題があった。

source: There was a problem sending the SB_GETPARTS message, or no reply was received within 2000 ms.
ja: SB_GETPARTS メッセージの送信に問題があったか、または 2000 ミリ秒以内に応答を受信しなかった。

source: Therefore, File.Pos may report 3 or 2 immediately after opening the file.
ja: そのため、File.Posでは、ファイルを開いた直後に3や2を報告することがあります。

source: Therefore, super.Method() is mostly equivalent to (ClassName.Prototype.base.Method)(this) (but without Prototype when Method is static).
ja: したがって、super.Method()は、(ClassName.Prototype.base.Method)(this)とほぼ等価である（ただし、Methodがstaticの場合はPrototypeを含まない）。

source: Therefore, Pause() now only pauses the current thread (for combinations like ListVars/Pause), while Pause(Value) now always operates on the underlying thread.
ja: したがって、Pause()は現在のスレッドを一時停止するだけになり（ListVars/Pauseのような組み合わせの場合）、Pause(Value)は常に基本スレッドで動作するようになりました。

source: Therefore, Pause() now only pauses the current thread (for combinations like ListVars/Pause), while Pause(v) now always operates on the underlying thread.
ja: したがって、Pause()は現在のスレッドを一時停止するだけになり（ListVars/Pauseのような組み合わせの場合）、Pause(v)は常に基本スレッドで動作するようになりました。

source: Therefore, Else executes if the file is empty or does not exist.
ja: したがって、Elseはファイルが空であるか存在しない場合に実行されます。

source: Therefore, MAX_PATH limits have been left in place for the following:
ja: そのため、MAX_PATHの制限は以下のように残されている：

source: Therefore, a previous instance may not be found if:
ja: そのため、以下のような場合、以前のインスタンスが見つからないことがあります：

source: Therefore, a script should call IL_Destroy after destroying a TreeView's window if the ImageList will not be used for anything else.
ja: したがって、スクリプトはTreeViewのウィンドウを破棄した後にIL_Destroyを呼び出す必要があります。

source: Therefore, a single class definition must not contain both an __Init method and an instance variable declaration.
ja: したがって、1つのクラス定義に__Initメソッドとインスタンス変数宣言の両方を含めることはできません。

source: Therefore, a variable containing an address may be passed directly (whereas in v1, something like var+0 was necessary).
ja: そのため、アドレスを含む変数を直接渡すことができる（v1ではvar+0のようなものが必要であったが）。

source: Therefore, any objects referenced by local variables of those functions are not released, so __Delete is not called.
ja: したがって、これらの関数のローカル変数によって参照されるオブジェクトは解放されないので、__Deleteは呼び出されません。

source: Therefore, as an alternative to MaxThreads, consider using Critical as described below.
ja: そのため、MaxThreadsの代替として、以下のようにCriticalを使用することを検討します。

source: Therefore, as with any line containing an expression, if a line begins with a non-escaped open parenthesis ((), it is considered to be the start of a continuation section unless there is a closing parenthesis ()) on the same line.
ja: したがって、式を含むすべての行と同様に、エスケープされていない開括弧（(）で始まる行は、同じ行に閉括弧（)）がない限り、継続セクションの開始とみなされる。

source: Therefore, at least one of the parameters must be non-blank.
ja: したがって、パラメータの少なくとも1つは空白であってはならない。

source: Therefore, at least one of the window parameters (WinTitle, WinText, ExcludeTitle, ExcludeText) must be non-blank.
ja: したがって、ウィンドウ・パラメータ（WinTitle、WinText、ExcludeTitle、ExcludeText）の少なくとも1つは空白であってはならない。

source: Therefore, avoid using 0& for the standard items which appear on all windows.
ja: したがって、すべてのウィンドウに表示される標準的な項目には、0&を使用しないようにしてください。

source: Therefore, by modifying or distributing the Program (or any work based on the Program), you indicate your acceptance of this License to do so, and all its terms and conditions for copying, distributing or modifying the Program or works based on it.
ja: 従って、『プログラム』(あるいは『プログラム』を基にした著作物)を改変し たり頒布したりすることによって、あなたはそうするための本許諾書と、『プ ログラム』あるいはそれを基にした著作物の複製、頒布、改変に関する本許諾書の すべての条項と条件に同意したことになります。

source: Therefore, if SendInput intentionally activates another window (by means such as alt-tab), the coordinates of subsequent clicks within the same function will be wrong if they were intended to be relative to the new window rather than the old one.
ja: そのため、SendInputが意図的に別のウィンドウをアクティブにした場合（alt-tabなどの手段）、同じ関数内でのその後のクリックの座標が、古いウィンドウではなく新しいウィンドウに対するものであった場合、間違った座標になります。

source: Therefore, if a script will run under multiple color depths, it is best to test it on each depth setting.
ja: したがって、複数の色深度でスクリプトを実行する場合は、各色深度の設定でテストするのがベストです。

source: Therefore, if a thread is interrupted by another, upon being resumed it will still see its original/correct values in these variables.
ja: したがって、スレッドが他のスレッドによって中断されても、再開されたときには、これらの変数に元の値や正しい値が表示される。

source: Therefore, if the GUI is destroyed while an event is being dispatched, subsequent event callbacks are not called.
ja: したがって、イベントのディスパッチ中にGUIが破壊された場合、その後のイベントコールバックは呼び出されません。

source: Therefore, if the script intends to use the pointer after calling this function, it must call ObjAddRef(DispPtr) first.
ja: したがって、スクリプトがこの関数を呼び出した後にポインタを使用しようとする場合、最初にObjAddRef(DispPtr)を呼び出す必要があります。

source: Therefore, it is best to use this function to create only those hotkeys whose key names are not known until after the script has started running.
ja: したがって、この機能は、スクリプトの実行が開始されるまでキー名がわからないホットキーだけを作成するために使用するとよいでしょう。

source: Therefore, it is safest to set the DPI awareness immediately before using any functions which rely on it.
ja: そのため、DPIに依存する機能を使用する前に、DPIを設定するのが最も安全です。

source: Therefore, it should be used only when you alt-tab solely by means of remapped keys and/or alt-tab hotkeys.
ja: したがって、リマップキーやalt-tabホットキーのみでalt-tabを行う場合にのみ使用すべきである。

source: Therefore, label lookup can be limited to the local label list.
ja: そのため、ラベル検索をローカルラベルリストに限定することができます。

source: Therefore, the color of what lies behind the icon does not matter.
ja: したがって、アイコンの後ろにあるものの色は関係ありません。

source: Therefore, the following additional limitations also apply:
ja: したがって、以下の追加制限も適用されます：

source: Therefore, the keyboard hook is normally installed only when the script contains one of the following:
ja: したがって、通常、キーボードフックは、スクリプトに次のいずれかが含まれている場合にのみインストールされます：

source: Therefore, the keyboard hook is normally installed only when the script contains one of the following: 1) hotstrings; 2) one or more hotkeys that require the keyboard hook (most do not); 3) SetCaps/Scroll/NumLock AlwaysOn/AlwaysOff; 4) active Input hooks.
ja: したがって、通常、キーボードフックは、スクリプトに次のいずれかが含まれている場合にのみインストールされます：1)ホットストリング、2) キーボードフックを必要とする1つまたは複数のホットキー（ほとんどは必要ありません）、3)SetCaps/Scroll/NumLock AlwaysOn/AlwaysOff、4) アクティブな入力フックです。

source: Therefore, the location in the script is not significant (and, like other directives, #Warn cannot be executed conditionally).
ja: したがって、スクリプト内の位置は重要ではありません（また、他のディレクティブと同様、#Warnは条件付きで実行することはできません）。

source: Therefore, the mouse hook is normally installed only when the script contains one or more mouse hotkeys.
ja: したがって、マウスフックは通常、スクリプトに1つまたは複数のマウスホットキーが含まれている場合にのみインストールされます。

source: Therefore, the reload function should be followed by whatever actions you want taken in the event of a failure (such as a return to exit the current subroutine).
ja: したがって、リロード関数の後には、失敗した場合に実行したい動作（現在のサブルーチンを終了するためのreturn）などを記述する必要があります。

source: Therefore, the return value is a success code in the range 0 to 2147483647.
ja: したがって、戻り値は0～2147483647の範囲の成功コードとなります。

source: Therefore, the script must inform the object that it has gained a reference.
ja: したがって、スクリプトはオブジェクトに参照を得たことを通知しなければならない。

source: Therefore, there is no need to check for invalid jumps from inside a function to outside (which were never supported).
ja: そのため、（これまでサポートされていなかった）関数内部から外部への無効なジャンプをチェックする必要がありません。

source: Therefore, to explicitly shrink a variable, first free its memory with VarSetStrCapacity(&Var, 0) and then use VarSetStrCapacity(&Var, NewCapacity) -- or simply let it auto-expand from zero as needed.
ja: したがって、変数を明示的に縮小するには、まずVarSetStrCapacity(&Var, 0)でメモリを解放し、次にVarSetStrCapacity(&Var, NewCapacity)を使う。

source: Therefore, to include an actual quote mark inside a literal string, escape the quote mark or enclose the string in the opposite type of quote mark.
ja: 従って、リテラル文字列の中に実際の引用符を含めるには、引用符をエスケープするか、文字列を反対のタイプの引用符で囲みます。

source: Therefore, to locate specific row(s) based on their contents, it is usually best to use the GetText method in a loop.
ja: そのため、特定の行を内容から探すには、通常、ループ内でGetTextメソッドを使用するのが最適です。

source: Therefore, to work with numbers greater or equal to 0x8000000000000000, omit the U prefix and interpret any negative values received from the function as large integers.
ja: したがって、0x800000000000以上の数値を扱う場合は、U接頭辞を省略し、関数から受け取った負の値を大きな整数として解釈してください。

source: Therefore, to work with numbers greater than or equal to 0x8000000000000000, omit the U prefix and interpret any negative values as large integers.
ja: したがって、0x800000000000以上の数値を扱う場合は、U接頭辞を省略し、負の値は大きな整数として解釈します。

source: These actions are prohibited by law if you do not accept this License.
ja: 本使用許諾に同意しない場合、これらの行為は法律で禁止されています。

source: These all exist as predefined classes.
ja: これらはすべて、あらかじめ定義されたクラスとして存在します。

source: These all relate to objects in some way.
ja: これらはすべて、何らかの形でオブジェクトに関係するものです。

source: These are actually keywords, not variables.
ja: これらは実際にはキーワードであり、変数ではありません。

source: These are attached to the class object itself, but are also inherited by subclasses, so this refers to either the class itself or a subclass.
ja: これらはクラス・オブジェクト自体に付属していますが、サブクラスにも継承されます。従って、thisはクラス自身かサブクラスのどちらかを指します。

source: These are currently hard-coded; they do not exist as properties and are not affected by modifications to ComObjArray.Prototype.
ja: これらは現在ハードコードされており、プロパティとして存在せず、ComObjArray.Prototypeの修正によって影響を受けることはありません。

source: These are displayed by an error dialog if the exception is thrown and not caught.
ja: 例外が発生し、捕捉されなかった場合は、エラーダイアログで表示されます。

source: These are implemented by external libraries, so often differ in behaviour to AutoHotkey objects.
ja: これらは外部ライブラリによって実装されているため、AutoHotkeyオブジェクトとは動作が異なることがよくあります。

source: These are known as hotkey variants.
ja: これらは、ホットキーバリアントと呼ばれるものです。

source: These are known as hotstring variants.
ja: これらはホットストリング・バリアントと呼ばれています。

source: These are similar to XM and YM except that they refer to coordinates that were saved by having previously added a control with the word Section in its options (the first control of the window always starts a new section, even if that word isn't specified in its options).
ja: これらはXMと YMに似ていますが、オプションにSectionという単語を持つコントロールを事前に追加して保存した座標を参照する点が異なります（ウィンドウの最初のコントロールは、オプションにその単語が指定されていなくても、常に新しいセクションを開始します）。

source: These are special Alt-Tab hotkey actions that are described here.
ja: これらは、ここで説明するAlt-Tabの特殊なホットキーアクションです。

source: These are the 3-D counterparts of SM_CXBORDER and SM_CYBORDER.
ja: これらはSM_CXBORDERとSM_CYBORDERの3次元対応である。

source: These are the same as the built-in variables A_ScreenWidth and A_ScreenHeight.
ja: これらは、組み込み変数A_ScreenWidthおよびA_ScreenHeightと同じである。

source: These are the same strings that were used with IfMsgBox in v1.
ja: これらはv1のIfMsgBoxと同じ文字列です。

source: These are usually standard Windows controls which have been around a long time, as newer controls use the WM_NOTIFY message (see OnNotify).
ja: 新しいコントロールはWM_NOTIFYメッセージ（OnNotify参照）を使用するため、これらは通常、古くからあるWindows標準コントロールです。

source: These built-in variables should usually be assigned values when the script starts (if the default settings are not suitable), but the script can get or set their values at any time.
ja: これらの組み込み変数は、（デフォルト値が適切でない場合）通常スクリプトの開始時に値を割り当てる必要がありますが、スクリプトはいつでもその値を取得または設定することができます。

source: These built-in variables should usually be assigned values when the script starts (if the default values are not suitable), but the script can get or set their values at any time.
ja: これらの組み込み変数は、通常スクリプトの開始時に値を割り当てる必要がありますが（デフォルト値が適切でない場合）、スクリプトはいつでもその値を取得または設定することができます。

source: These can be used as hotkeys with some (but not all) mice which have a second wheel or support tilting the wheel to either side.
ja: 2つめのホイールがあったり、ホイールを左右に傾けることができたりするマウスでホットキーとして使用できます。

source: These classes can be used for type checks with obj is ComObject and similar.
ja: これらのクラスは、obj is ComObjectなどのタイプチェックに使用できます。

source: These coordinates are relative to the upper-left corner of the target window's client area and thus are the same as those used by ControlMove.
ja: この座標は、ターゲットウィンドウのクライアント領域の左上隅を基準にしているため、ControlMove関数で使用される座標と同じです。

source: These declarations are evaluated each time a new instance of the class is created with ClassName(), after all base-class declarations are evaluated but before __New is called.
ja: これらの宣言は、ClassName()でクラスの新しいインスタンスが生成されるたびに評価され、すべての基本クラス宣言が評価された後、__Newが呼ばれる前に評価されます。

source: These declarations are evaluated only once, when the class is initialized.
ja: これらの宣言は、クラスが初期化されるときに一度だけ評価される。

source: These defaults can be changed during script startup.
ja: これらのデフォルトは、スクリプト起動時に変更することができます。

source: These defaults can be overridden by defining a property or calling DefineProp.
ja: これらのデフォルトは、プロパティを定義するかDefinePropを呼び出すことでオーバーライドできます。

source: These details are typically important for scripts which do any of the following:
ja: これらの詳細は、通常、次のいずれかを実行するスクリプトで重要です：

source: These dialogs can be displayed via DllCall as demonstrated at GitHub.
ja: これらのダイアログは、GitHubでデモされているように、DllCallを介して表示することができます。

source: These dialogs use structures and are demonstrated at GitHub.
ja: これらのダイアログは構造体を使用しており、GitHubでデモが行われています。

source: These directives copy the version number 1.2.3.4 into the special variable U_version, and the company name My Company into the special variable U_company for use in other directives later.
ja: これらのディレクティブはバージョン番号1.2.3.4を特殊変数U_versionにコピーし、会社名My Companyを特殊変数U_companyにコピーして、後で他のディレクティブで使えるようにします。

source: These do not apply to a specific instance, and can be used by referring to the class itself by name.
ja: これらは特定のインスタンスには適用されず、クラス自体を名前で参照することで使用できる。

source: These do not support long paths due to limitations of the underlying system function(s):
ja: これらは、基礎となるシステム機能の制限により、長いパスをサポートしていない：

source: These effects are not applied by ControlFocus, and therefore the following limitations apply:
ja: これらの効果はControlFocusでは適用されないため、以下の制限が適用されます：

source: These error codes can be found at GitHub (ErrorCodes.md).
ja: これらのエラーコードはGitHub（ErrorCodes.md）で見ることができる。

source: These escape sequences stand for special characters.
ja: これらのエスケープシーケンスは特殊文字を表す。

source: These files are given the "_UIA.exe" suffix.
ja: これらのファイルには「_UIA.exe」という接尾辞が付けられます。

source: These formats are not case sensitive.
ja: これらのフォーマットは、大文字と小文字を区別しません。

source: These formats are not case-sensitive.
ja: これらのフォーマットは、大文字と小文字は区別されません。

source: These functions also accept any other object which has Ptr and Size properties, but are optimized for the native Buffer object.
ja: これらの関数は、Ptrと Sizeプロパティを持つ他のオブジェクトも受け付けますが、ネイティブのBufferオブジェクトに最適化されています。

source: These functions are equivalent to built-in methods of the Object type.
ja: これらの関数は、Object型の組み込みメソッドに相当します。

source: These functions can generally be used two ways:
ja: これらの機能は、一般的に2通りの使い方があります：

source: These functions perform various checks.
ja: これらの機能により、さまざまなチェックが行われます。

source: These functions return the new reference count.
ja: これらの関数は、新しい参照カウントを返します。

source: These functions return the newly converted version of the specified string.
ja: これらの関数は、指定された文字列を新しく変換したものを返す。

source: These functions return the style or extended style (respectively) of the specified window.
ja: これらの関数は、指定されたウィンドウのスタイルまたは拡張スタイル（それぞれ）を返します。

source: These functions return the style or extended style of the specified control.
ja: これらの関数は、指定されたコントロールのスタイルまたは拡張スタイルを返します。

source: These functions return the trimmed version of the specified string.
ja: これらの関数は、指定された文字列を切り詰めたものを返します。

source: These functions support Unicode only in UTF-16 files; all other files are assumed to use the system's default ANSI code page.
ja: これらの関数は、UTF-16ファイルでのみUnicodeをサポートし、それ以外のファイルではシステムのデフォルトのANSIコードページを使用するものとします。

source: These functions throw an exception if any incoming parameters are non-numeric or an invalid operation (such as divide by zero) is attempted.
ja: これらの関数は、入力されるパラメータが非数値であったり、不正な操作（ゼロ除算など）を行おうとした場合に例外を発生させます。

source: These functions will probably not work on a network drive or any drive lacking the "Eject" option in Explorer.
ja: これらの機能は、ネットワークドライブやエクスプローラーの「取り出し」オプションがないドライブでは、おそらく機能しないでしょう。

source: These limitations are imposed by the OS.
ja: これらの制限はOSによって課される。

source: These limitations are often referred to as "MAX_PATH limitations", after the constant MAX_PATH, which has the value 260.
ja: これらの制限は、値260を持つ定数MAX_PATHにちなんで、しばしば「MAX_PATH制限」と呼ばれる。

source: These modes must be specified as {x} in Keys, where x is either Raw, Text, or Blind.
ja: これらのモードは、Keysの{x}として指定する必要があり、xはRaw、Text、Blindのいずれかです。

source: These modifiers have the same meaning as with hotkeys.
ja: これらの修飾語は、ホットキーの場合と同じ意味を持ちます。

source: These names are suggestive only.
ja: これらの名称はあくまでも示唆的なものである。

source: These notes for OnEvent also apply to OnCommand:
ja: OnEventに関するこれらの注意は、OnCommandにも適用されます：

source: These notes for OnEvent also apply to OnCommand: Threads, Destroying the GUI.
ja: OnEventに関するこれらの注意は、OnCommandにも適用されます：スレッド、GUIを破壊します。

source: These notes for OnEvent also apply to OnNotify:
ja: OnEventに関するこれらの注意は、OnNotifyにも適用される：

source: These notes for OnEvent also apply to OnNotify: Threads, Destroying the GUI.
ja: OnEventに関するこれらの注意は、OnNotifyにも適用されます：スレッド、GUIを破壊します。

source: These notifications are documented at Microsoft Docs.
ja: これらの通知については、Microsoft Docsで文書化されています。

source: These occur rarely in COM calls, but this also applies to VT_BYREF wrappers.
ja: これらはCOMコールで稀に発生しますが、VT_BYREFラッパーにも適用されます。

source: These operators can also be used with a property of an object, such as myArray.Length++ or --myArray[i].
ja: これらの演算子は、myArray.Length++や --myArray[i]のように、オブジェクトのプロパティと組み合わせて使うこともできる。

source: These options are mutually exclusive:
ja: これらのオプションは相互に排他的です。

source: These options are mutually exclusive: only one can be in effect at a time.
ja: これらのオプションは相互に排他的です：同時に1つだけ有効にすることができます。

source: These parameters are defined automatically by method and property definitions within a class, but must be defined explicitly if using normal functions.
ja: これらのパラメータは、クラス内のメソッドやプロパティ定義によって自動的に定義されますが、通常の関数を使用する場合は明示的に定義する必要があります。

source: These references are only released if the function or expression is allowed to complete normally.
ja: これらの参照は、関数や式が正常に完了した場合にのみ解放される。

source: These requirements apply to the modified work as a whole.
ja: これらの要件は、修正された作品全体に適用される。

source: These restrictions translate to certain responsibilities for you if you distribute copies of the software, or if you modify it.
ja: これらの制限は、あなたがソフトウェアのコピーを配布する場合、またはあなたがソフトウェアを変更する場合、あなたに一定の責任が生じることを意味します。

source: These settings are permanent; this is, they apply for all current and future visits to this help.
ja: これらの設定は永続的なものであり、現在および将来、このヘルプを訪れるすべての人に適用されます。

source: These styles affect the Button, CheckBox, Radio, or GroupBox controls.
ja: これらのスタイルはButton、CheckBox、Radio、GroupBoxコントロールに影響する。

source: These styles affect the DateTime control.
ja: これらのスタイルはDateTimeコントロールに影響する。

source: These styles affect the DropDownList and ComboBox controls.
ja: これらのスタイルはDropDownListとComboBoxコントロールに影響する。

source: These styles affect the Edit control.
ja: これらのスタイルはEditコントロールに影響する。

source: These styles affect the ListBox control.
ja: これらのスタイルはListBoxコントロールに影響する。

source: These styles affect the ListView control.
ja: これらのスタイルはListViewコントロールに影響する。

source: These styles affect the MonthCal control.
ja: これらのスタイルはMonthCalコントロールに影響を与える。

source: These styles affect the Picture control.
ja: これらのスタイルはPictureコントロールに影響を与える。

source: These styles affect the Progress control.
ja: これらのスタイルはProgressコントロールに影響を与える。

source: These styles affect the Slider control.
ja: これらのスタイルはSliderコントロールに影響する。

source: These styles affect the StatusBar control.
ja: これらのスタイルはStatusBarコントロールに影響する。

source: These styles affect the Tab control.
ja: これらのスタイルはTabコントロールに影響する。

source: These styles affect the Text control.
ja: これらのスタイルはTextコントロールに影響する。

source: These styles affect the TreeView control.
ja: これらのスタイルはTreeViewコントロールに影響を与える。

source: These styles affect the UpDown control.
ja: これらのスタイルはUpDownコントロールに影響する。

source: These styles are entirely separate from generic extended styles.
ja: これらのスタイルは、一般的な拡張スタイルとは全く別のものです。

source: These support ad hoc properties, and have methods for discovering which properties exist.
ja: これらはアドホック・プロパティに対応し、どのプロパティが存在するかを発見するメソッドを持っている。

source: These techniques can also be applied to properties and methods of objects.
ja: これらのテクニックは、オブジェクトのプロパティやメソッドにも適用できます。

source: These terms are generally interchangeable for AutoHotkey v2, where functions are the only type of subroutine.
ja: これらの用語は、関数がサブルーチンの唯一のタイプであるAutoHotkey v2では一般的に互換性があります。

source: These tutorials focus on specific common tasks:
ja: これらのチュートリアルは、特定の共通タスクに焦点を当てています：

source: These type names have the same meanings as with DllCall.
ja: これらの型名は、DllCallと同じ意味を持ちます。
